<?php
return  array(
	// 作业完成状态常量设置
	'WORK_COMPLETE_STATE' => array(
		'没有完成'    =>  '没有完成',
		'部分完成'    =>  '部分完成',
		'全部完成'    =>  '全部完成'
	),
	'EXAM_TYPE' => array(
		11 => '月考',
		12 => '期中',
		13 => '期末',
		14 => '会考',
		15 => '中考',
		16 => '高考' ),
	'SUBJECT_TYPE' => array(
		'语文' => '语文',
		'数学' => '数学',
		'英语' => '英语',
		'物理' => '物理',
		'化学' => '化学',
		'生物' => '生物',
		'地理' => '地理',
		'政治' => '政治',
		'历史' => '历史',
		'体育' => '体育'
	),
	'WEIHU_TYPE' => array(
		11 => '首次课前',
		12 => '首次课后',
		13 => '考前回访',
		14 => '考后回访',
		15 => '日常沟通',
		16 => '课程调整'
	),
	'VISIT_TYPE' => array(
		11 => '去电',
		12 => '来电',
		13 => '面谈',
		14 => '家长会'
	),
	'TASK_LEVEL' => array(
		'c' => '去电/来电',
		'b' => '面谈',
		'a' => '家长会'
	),
	'PARENT_TYPE' => array(
		'爸爸' => '爸爸',
		'妈妈' => '妈妈',
		'爷爷' => '爷爷',
		'奶奶' => '奶奶',
		'姥爷' => '姥爷',
		'姥姥' => '姥姥',
		'哥哥' => '哥哥',
		'姐姐' => '姐姐',
		'叔叔' => '叔叔',
		'婶婶' => '婶婶',
		'其他' => '其他'
	),
	'VISIT_FREQUENCY' => array(
		4 => '4天回访一次',
		7 => '7天回访一次',
		15 => '15天回访一次',
		30 => '30天回访一次'
	),
	'ADVICE_TYPE' => array(
		'11' => '加课', 
		'12' => '学员作业问题',
		'13' => '学员状态问题',
		'14' => '转介绍挖掘',
		'15' => '其它'
		),
	'STUDENT_STATE' => array(
		1 => '正常',
		2 => '停课',
		3 => '结课',
		4 => '毕业',
		5 => '退费',
		6 => '自习学员'
		
	),
	'SEX_TYPE' => array(
	    0 => '女',
	    1 => '男'
	)
);